Revit 2027 API
UnitUtils.GetTypeCatalogStringForUnit Method
 Gets the string used in type catalogs to identify a given unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetTypeCatalogStringForUnit(
	ForgeTypeId unitTypeId
)
Public Shared Function GetTypeCatalogStringForUnit (
	unitTypeId As ForgeTypeId
) As String
public:
static String^ GetTypeCatalogStringForUnit(
	ForgeTypeId^ unitTypeId
)
static member GetTypeCatalogStringForUnit :
        unitTypeId : ForgeTypeId -> string
Parameters
unitTypeId ForgeTypeId
 Identifier of the unit.
Return Value
String
 The type catalog string, or an empty string if the unit cannot be used in type catalogs.
Exceptions
Exception | Condition
ArgumentException |  unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace